[
  {
    "Code": "ITWS",
    "Num": 1100,
    "Name": "INTRO TO IT & WEB SCIENCE",
    "Semester": "Spring",
    "Description": "This course introduces students to the field of information technology and Web science, the types of problems encountered in the field, and the solution approaches used to solve them. Through a series of activities and projects, students are introduced to topics such as Web systems design, emerging Web standards, database systems, security, and computer networking. Guest speakers highlight information technology practices in industry. Students work in groups on a team project and presentation at the end of the course.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 1220,
    "Name": "IT AND SOCIETY",
    "Semester": "Spring",
    "Description": "Will IT increase prosperity? For whom? What role should governments play in IT development? Do corporations have new responsibilities in the Information Era? What about IT professionals? This course explores the issues, the arguments and working solutions. The first section examines macro indicators and trends. The second section examines the microeconomics and politics of specific arenas—the software industry, the automated work place, telemedicine, television. The last section explores opportunities for improving society, using IT. This is a communication-intensive course.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 2210,
    "Name": "INTRODUCTION TO HCI",
    "Semester": "Spring",
    "Description": "An introduction to the current theories, methods, and issues in human-computer interaction. Theory and research along with practical application are discussed within the context of organizational impact. The course provides the knowledge of HCI systems and research used for the implementation of safe, quick, and useable interactive technologies.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4100,
    "Name": "IT & WEB SCIENCE CAPSTONE",
    "Semester": "Spring",
    "Description": "Students work on collaborative projects to design innovative ITWS solutions which address a specific problem or area of need in the student’s field. Students work to identify a problem and research viable solutions. They go on to propose, design, and prototype their ITWS solution learning best practices for ITWS project management, communication, and user-center design. This course serves as the culminating experience for the undergraduate ITWS program. Restricted to ITWS majors. This is a communication-intensive course.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4300,
    "Name": "BUSINESS ISSUES FOR ENGR & SCI",
    "Semester": "Spring",
    "Description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4310,
    "Name": "MANAGING IT RESOURCES",
    "Semester": "Spring",
    "Description": "This course provides an introduction to fundamental concepts of management and applies them to IT. It examines the use of IT in business processes and the management issues of integrating IT into organizational processes to gain competitive advantage. Topics include: management, organizations, and information systems; development life cycle; project management and systems engineering; process reengineering; and organizational learning. This course includes the planning, development, and implementation of an IT project for a real client.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4370,
    "Name": "INFORMATION SYSTEM SECURITY",
    "Semester": "Spring",
    "Description": "This course covers foundational models for information security, policies, authentication, access control, database security, assurance, auditing, and intrusion detection. It also devotes substantial time to secure coding practices. Students will be expected to complete projects that explore an aspect of information security in detail. Cryptography is not covered since it is a focus of other courses.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4400,
    "Name": "XINFORMATICS",
    "Semester": "Spring",
    "Description": "Informatics covers a broad range of disciplines addressing challenges in the explosion of data and information resources. X-informatics provides commonality for implementations in specific disciplines, e.g. X=astro, geo. Informatics’ theoretical bases are information and computer science, cognitive science, social science, library science, aggregating these studies and adding the practice of information processing, and the engineering of information systems. This course grounds the material that students will learn in discipline areas by coursework and project assignments.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4500,
    "Name": "WEB SCIENCE SYSTEMS DEV",
    "Semester": "Spring",
    "Description": "Building on the technology covered in Web Systems Development, students will be exposed to current technologies, frameworks, and practices in the area of Web development. Types of topics included will be HTML5/CSS3, API’s for data, Ruby on Rails, node.js, MongoDB, PHP, and RDF. Methodology to be explored will be application design, software versioning, and team development. Lab intensive, this course is intended to complete a foundation for the advanced courses in Data Science and Advanced Web Science.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4600,
    "Name": "DATA ANALYTICS",
    "Semester": "Spring",
    "Description": "The world at-large is confronted with increasingly larger and complex sets of structured/unstructured information; from cyber and human sources. Traditional enterprises are moving toward analytics-driven approaches for core business functions. Data and information analytics extends analysis (descriptive models of data) by using data mining and machine learning methods, with optimization and validation, to recommend action or guide and communicate decision-making. Thus, analytics is an entire methodology rather than individual analyses or analysis steps.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4980,
    "Name": "SPECIAL PROJECTS",
    "Semester": "Spring",
    "Description": "Active participation in a senior-level project supervised by a faculty member and requiring a presentation and project report. Grades of “in-progress” are assigned until the special project has been approved by the faculty member.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 4990,
    "Name": "SENIOR THESIS",
    "Semester": "Spring",
    "Description": "A two-semester spring-fall or fall-spring course dealing with an advanced level independent research project supervised by a faculty member and requiring the presentation of a thesis. First term registration is limited to second semester juniors and first semester seniors. The grade for the first semester will be listed as “In progress.”",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6300,
    "Name": "BUSINESS ISSUES FOR ENGR & SCI",
    "Semester": "Spring",
    "Description": "Investigates business-related considerations in successfully commercializing new technology in a new venture or within an existing enterprise: market and customer analysis, beating the competition, planning and managing for profitability, high-tech marketing and sales, and business partnerships and acquisitions. Not a general management course; focuses explicitly on what is relevant for engineers and scientists working in a commercial environment. For junior/senior undergraduate or graduate students.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6400,
    "Name": "XINFORMATICS",
    "Semester": "Spring",
    "Description": "Informatics covers a broad range of disciplines addressing challenges in the explosion of data and information resources. X-informatics provides commonality for implementations in specific disciplines, e.g. X=astro, geo. Informatics’ theoretical bases are information and computer science, cognitive science, social science, library science, aggregating these studies and adding the practice of information processing and the engineering of information systems. This course grounds the material that students will learn in discipline areas by coursework and project assignments.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6600,
    "Name": "DATA ANALYTICS",
    "Semester": "Spring",
    "Description": "The world at-large is confronted with increasingly larger and complex sets of structured/unstructured information; from cyber and human sources. Traditional enterprises are moving toward analytics-driven approaches for core business functions. Data and information analytics extends analysis (descriptive models of data) by using data mining and machine learning methods, with optimization and validation, to recommend action or guide and communicate decision-making. Thus, analytics is an entire methodology rather then individual analyses or analysis steps.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6700,
    "Name": "SOFTWARE DEVELOPMENT",
    "Semester": "Spring",
    "Description": "This course teaches students about the roles and infrastructure of IT departments in modern organizations, IT software engineering technologies and methodologies for software development life cycle through hands-on experience. The course is for students with software development background to enhance their knowledge of software development and management, the software development industry, open source community, etc.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6800,
    "Name": "IT MASTER'S CAPSTONE",
    "Semester": "Spring",
    "Description": "Integration of the knowledge and professional practice of the Master’s in IT core and concentration courses. Topics in database systems, networking, software design, human computer interaction, management of technology, and ethics are applied within a framework of global e-business strategy. The course utilizes a Team Project with a real organization to practice major IT concepts. Team members select, develop, and present a significant technology implementation project, incorporating strategy, systems development, and business planning.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6980,
    "Name": "MASTER'S PROJECT",
    "Semester": "Spring",
    "Description": "Active participation in a master’s-level project, under the supervision of a faculty adviser, leading to a master’s project report. Grades S or U are assigned at the end of the semester. If recommended by the adviser, the master’s project may be accepted by the Office of Graduate Education to be archived in the library.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  },
  {
    "Code": "ITWS",
    "Num": 6990,
    "Name": "MASTERS THESIS",
    "Semester": "Spring",
    "Description": "Active participation in research, under the supervision of a faculty adviser, leading to a master’s thesis. Grades of S or U are assigned by the adviser each term to reflect the student’s research progress for the given semester. Once the thesis has been presented, approved by the adviser, and accepted by the Office of Graduate Education, it will be archived in a standard format in the library.",
    "Pre-Reqs" : [
    ],
    "Co-Reqs" : [
    ],
    "Major-Restriction" : ""
  }
 ]